# 10-5, 6
pnorm(2,0,1) - pnorm(-1)		# P(-1<Z<2) 0,1은 생략가능
pnorm(1.71) - pnorm(1.22)		# P(1.22<Z<1.71) = 0.9554 - 0.8888

# 11-3
qnorm(0.01)
qnorm(0.05)

qnorm(0.995)	# P(|Z| < c) = 0.99

# 12-3	X~N(100, 6^2)
pnorm(110, 100, 6) - pnorm(90, 100, 6) 	#P(90<X<100)

# 13		X~N(100, 8^2)
qnorm(0.975, 100, 8)	# P(X>c) = 0.025
qnorm(0.05, 100, 8)
qnorm(0.95, 100, 8)

sqrt(100)		# 루트
abs(-100)		# 절대값

# 15
pnorm(80, 90, 20)	# 확률을 찾는건 pnorm
qnorm(0.05, 90, 20)	# 값을 찾는 건 qnorm

# 예제 6-8		X~B(10, 0.5)	평균 = np = 5, 분산 = np(1-p) = 2.5
pbinom(4, 10, 0.5) - pbinom(1, 10, 0.5)	   # P(2<=X<=4)
pnorm(4, 5, sqrt(2.5)) - pnorm(2, 5, sqrt(2.5))   # P(2<=X<=4)
pnorm(4.5, 5, sqrt(2.5)) - pnorm(1.5, 5, sqrt(2.5))   # P(1.5<=X<=4.5)

# 예제 6-9		X~B(100, 0.5)
pbinom(40, 100, 0.5) - pbinom(19, 100, 0.5)	   # P(20<=X<=40)
pnorm(40, 50, 5) - pnorm(20, 50, 5)   # P(20<=X<=40)
pnorm(40.5, 50, 5) - pnorm(19.5, 50, 5)   # P(19.5<=X<=40.5)

# 예제 6-10		X~B(100, 0.8)
pbinom(73, 100, 0.8)		# P(X<74)
pnorm(73.5, 80, 4)
pnorm(74, 80, 4)

pbinom(85, 100, 0.8) - pbinom(73, 100, 0.8)	# P(74<=X<=85)
pnorm(85, 80, 4) - pnorm(74, 80, 4)
pnorm(85.5, 80, 4) - pnorm(73.5, 80, 4)

# 16
pbinom(17, 20, 0.6) - pbinom(13, 20, 0.6)		# P(14<=X<=17)
pnorm(17, 12, sqrt(4.8)) - pnorm(14, 12, sqrt(4.8))
pnorm(17.5, 12, sqrt(4.8)) - pnorm(13.5, 12, sqrt(4.8))

# 17		p=0.6 n=80 P(X<=47)
pbinom(47, 80, 0.6)

# 18		mu=2.95 sd=0.5 P(X>c)=0.1
qnorm(0.9, 2.95, 0.5)

# 19		n=500 p=0.1 mu=50 P(X>40) = 1-P(X<=40)
1-pbinom(40, 500, 0.1)
1-pnorm(40, 50, sqrt(45))
1-pnorm(40.5, 50, sqrt(45))

# 21
pnorm(170, 172, 5)

# 25
qnorm(0.05, 500, 100)

# 26
1-pnorm(88, 68.4, 10)