# 연습문제 3번

# x~N(20, 8^2)	n=16	xbar~N(20, (8/4)^2)

# p(xbar >= 23)

1 - pnorm(23, 20, 2)

# p(18 <= xbar <= 21)
pnorm(21, 20, 2) - pnorm(18, 20, 2)

# 5번 x~N(40, 18^2)	n=36		xbar~N(40, (18/6)^2)
pnorm(43, 40, 3) - pnorm(34, 40, 3)

# 6번 x~N(900, 40^2)	n=100		xbar~N(900, 4^2)
#(1) p(x<940)
pnorm(940, 900, 40) * 1000

#(2) p(xbar>905)
1-pnorm(905, 900, 4)

# 13번 x~N(300, 100^2), n=100, Xbar~N(300, 10^2)
# p(xbar>290)
1-pnorm(290, 300, 10)

# 14번 x~N(100, 10^2), n=25, Xbar~N(100, 2^2)
# p(97<=xbar<=102)
pnorm(102, 100, 2) - pnorm(97, 100, 2)

# 15번 x~N(120, 20^2), n=25, Xbar~N(120, 4^2)
# p(xbar>x) = 0.05
qnorm(0.95, 120, 4)

# 분포그래프
curve(dchisq(x, 4), 0, 15)
curve(dchisq(x, 10), 0, 30)
curve(dchisq(x, 30), 0, 60)

curve(dnorm(x), -5, 5)
curve(dt(x, 20), -5, 5, add=T)

# 7번
#(1)
qchisq(0.95, 4)
#(3)
qchisq(0.025, 16)

# 8번
#(2)
1-pchisq(31.4104, 20)	# 자유도를 꼭 써줘야함
#(3)
pchisq(28.4120, 20) - pchisq(9.5908, 20)

# 9번
#(1)
qt(0.95, 6)
#(3)
qt(0.01, 20)

# 10번
#(3)
pt(2.787, 25) - pt(1.708, 25)